# Importing Libraries

In [10]:
 
import pandas as pd
import numpy as np
import os

In [11]:
path = r'/Users/jessicagiron/Desktop/Instacart Basket Analysis 2023/02 Data/Original Data/orders.csv'
print (path)

/Users/jessicagiron/Desktop/Instacart Basket Analysis 2023/02 Data/Original Data/orders.csv

In [12]:
df_ords=pd.read_csv(path, index_col=False)

In [13]:
path2=r'/Users/jessicagiron/Desktop/Instacart Basket Analysis 2023/02 Data/Original Data/products.csv'
print (path2)

/Users/jessicagiron/Desktop/Instacart Basket Analysis 2023/02 Data/Original Data/products.csv

In [14]:
df_prods=pd.read_csv(path2, index_col=False)

In [15]:
path3=r'/Users/jessicagiron/Desktop/Instacart Basket Analysis 2023/02 Data/Original Data/departments 2.csv'
print(path3)

/Users/jessicagiron/Desktop/Instacart Basket Analysis 2023/02 Data/Original Data/departments 2.csv

In [16]:
df_dep=pd.read_csv(path3, index_col=False)

# Dropping Columns

In [17]:
df_ords = df_ords.drop(columns = ['eval_set'])

In [48]:
df_prods=df_prods.drop(columns=['aisle_id'])

# Frequency

In [18]:
df_ords['days_since_prior_order'].value_counts(dropna=False)

30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: days_since_prior_order, dtype: int64

# Renaming Columns

In [19]:
df_ords.rename(columns={'order_dow':'order_day_of_week'}, inplace=True)

In [51]:
df_ords.rename(columns={'days_since_prior_order':'days_since_last_order'}, inplace=True)

# Changing a Variable Data Type

In [21]:
df_ords['order_id'] = df_ords['order_id'].astype('str')

In [22]:
df_ords['user_id']=df_ords['user_id'].astype('str')

In [23]:
df_ords['order_number']=df_ords['order_number'].astype('str')

# Transposing Data

In [24]:
df_dep_T=df_dep.T

In [25]:
df_dep_T.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [26]:
#take the first row of the df_dep_T for the header
new_header = df_dep_T.iloc[0]

In [27]:
#take the data under the head row for a new df
df_dep_t_new = df_dep_T[1:]

In [28]:
#set the header row as the df header
df_dep_t_new.columns = new_header

# Data Dictionary

In [29]:
data_dict = df_dep_t_new.to_dict('index')

In [30]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [31]:
print(data_dict.get('19'))

{'department': 'snacks'}

In [32]:
print(data_dict.get('4'))

{'department': 'produce'}

# Subsetting

In [33]:
# assigning the value 19 as snacks by referencing the dictionary. another code that could have been used is df_snacks_3 = df_prods.loc[df_prods['department_id'].isin([19])]

df_snacks =  df_prods[df_prods['department_id']==19]

# Anwers to 4.4 Questions

Busiest hour for placing orders: 10:00 hour, highest count of 288418

In [34]:
df_ords['order_hour_of_day'].value_counts(dropna=False)

10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: order_hour_of_day, dtype: int64

A daprtment_id value of 4 refers to produce

Breakfast Sales Subset

In [35]:
df_breakfast=df_prods.loc[df_prods['department_id']==14]

In [36]:
df_breakfast.head()

,product_id,product_name,aisle_id,department_id,prices
27,28,Wheat Chex Cereal,121,14,10.1
33,34,NaN,121,14,12.2
67,68,"Pancake Mix, Buttermilk",130,14,13.7
89,90,Smorz Cereal,121,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,14,3.6

Dinner Items Subset

In [37]:
df_dinner=df_prods.loc[df_prods['department_id'].isin([5,7,12,20])]

In [38]:
df_dinner.head()

,product_id,product_name,aisle_id,department_id,prices
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
6,7,Pure Coconut Water With Orange,98,7,4.4
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,8.4
10,11,Peach Mango Juice,31,7,2.8
16,17,Rendered Duck Fat,35,12,17.1

In [39]:
df_dinner.shape

(7650, 5)

The df_dinner has 7650 rows

In [40]:
df_ords_user1=df_ords.loc[df_ords['user_id']=='1']

In [41]:
df_ords_user1

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
5,3367565,1,6,2,7,19.0
6,550135,1,7,1,9,20.0
7,3108588,1,8,1,14,14.0
8,2295261,1,9,1,16,0.0
9,2550362,1,10,4,8,30.0
10,1187899,1,11,4,8,14.0

information about user 1

In [42]:
df_ords_user1.describe()

       order_day_of_week  order_hour_of_day  days_since_last_order
count          11.000000          11.000000              10.000000
mean            2.636364          10.090909              19.000000
std             1.286291           3.477198               9.030811
min             1.000000           7.000000               0.000000
25%             1.500000           7.500000              14.250000
50%             3.000000           8.000000              19.500000
75%             4.000000          13.000000              26.250000
max             4.000000          16.000000              30.000000

Stats on User 1

In [46]:
df_ords.to_csv(os.path.join('/Users/jessicagiron/Desktop/Instacart Basket Analysis 2023/02 Data/Prepared Data', 'orders_wrangled.csv'))

In [ ]:
#export wrangled orders data

In [45]:
df_dep_t_new.to_csv(os.path.join('/Users/jessicagiron/Desktop/Instacart Basket Analysis 2023/02 Data/Prepared Data', 'departments_wrangled.csv'))